In [1]:
import numpy as np
import pandas as pd

string_data = pd.Series(['板橋區', '中和區', np.nan, '土城區'])
string_data

0    板橋區
1    中和區
2    NaN
3    土城區
dtype: object

In [2]:
string_data.info()

<class 'pandas.core.series.Series'>
RangeIndex: 4 entries, 0 to 3
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      object
dtypes: object(1)
memory usage: 160.0+ bytes

In [8]:
print(string_data.dtype)

object

In [9]:
string_data[0] = None
string_data

0    None
1     中和區
2     NaN
3     土城區
dtype: object

In [10]:
string_data.info()

<class 'pandas.core.series.Series'>
RangeIndex: 4 entries, 0 to 3
Series name: None
Non-Null Count  Dtype
--------------  -----
2 non-null      object
dtypes: object(1)
memory usage: 160.0+ bytes

In [11]:
#shape,查詢欄和index的數量
string_data.shape

(4,)

In [13]:
#查詢遺失的資料
#isnull()
#notnull()

string_data.isnull().sum()

2

In [14]:
#查詢遺失的資料
string_data.notnull().sum()

2

In [15]:
#清除的資料
#drapna()
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [16]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [18]:
#使用過濾的方法
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [19]:
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3.],
                    [1., NA, NA],
                    [NA, NA, NA],
                    [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [21]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [23]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [27]:
data.iloc[0,1] = None
data.iloc[3,1] = None
data.dropna(axis=1,how='all')

     0    2
0  1.0  3.0
1  1.0  NaN
2  NaN  NaN
3  NaN  3.0

In [29]:
#2個以上的才移除
data.dropna(thresh=2)

     0   1    2
0  1.0 NaN  3.0

In [31]:
#填滿遺失資料
#fillna()
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -1.344915       NaN       NaN
1  1.009812       NaN       NaN
2  1.622309       NaN -0.150784
3 -1.677200       NaN -1.023205
4 -1.709631  1.182274 -0.153558
5  0.443131 -0.132154 -0.139360
6 -0.823625 -1.241538 -0.400053

In [32]:
df.fillna(0)

          0         1         2
0 -1.344915  0.000000  0.000000
1  1.009812  0.000000  0.000000
2  1.622309  0.000000 -0.150784
3 -1.677200  0.000000 -1.023205
4 -1.709631  1.182274 -0.153558
5  0.443131 -0.132154 -0.139360
6 -0.823625 -1.241538 -0.400053

In [34]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -1.344915  0.500000  0.000000
1  1.009812  0.500000  0.000000
2  1.622309  0.500000 -0.150784
3 -1.677200  0.500000 -1.023205
4 -1.709631  1.182274 -0.153558
5  0.443131 -0.132154 -0.139360
6 -0.823625 -1.241538 -0.400053

In [35]:
#檢查重覆的資料-duplicated()
#移除重覆的資料-drop_duplicates()
data = pd.DataFrame({'k1':['one', 'two']*3 + ['two'],
                    'k2':[1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4